EDT/УТ/src/Catalogs/новаОбменыДанными/новаОбменыДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаОбменыДанными</name>
  <comment>Содержит настройки импорта/экспорта данных</comment>
  <attributes>
    <name>КаталогЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписыватьЛог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьЛог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбмена</name>
    <type>
      <types>EnumRef.новаТипыОбменов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеСемафораОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РольВыгрузки</name>
    <type>
      <types>CatalogRef.новаЭтапыМестнойДоставки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПланыОбмена</name>
    <attributes>
      <name>ПланОбмена</name>
      <type>
        <types>CatalogRef.новаПланыИмпортаДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбмена</name>
      <type>
        <types>EnumRef.новаТипыОбменов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИменаФайлов</name>
    <attributes>
      <name>ЗадачаИмпорта</name>
      <type>
        <types>CatalogRef.новаЗадачаИмпортаДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/новаОбменыДанными/ObjectModule.bsl
Процедура ПриКопировании(ОбъектКопирования)
	УникальныйИдентификаторРегламентногоЗадания = Неопределено;    
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если Не ЗначениеЗаполнено(ТипОбмена) Тогда
#Если Клиент Тогда
		Предупреждение("Необходимо заполнить тип обмена");
#КонецЕсли		
		Отказ = Истина;
	    Возврат;
	КонецЕсли;
	
	ОбъектЗадания = Неопределено;
	Если ЗначениеЗаполнено(УникальныйИдентификаторРегламентногоЗадания) Тогда
		УИД = Новый УникальныйИдентификатор(УникальныйИдентификаторРегламентногоЗадания);
		ОбъектЗадания = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(УИД);
	КонецЕсли;                                        
	                           
	Если ОбъектЗадания = Неопределено Тогда
		ОбъектЗадания = РегламентныеЗадания.СоздатьРегламентноеЗадание("новаИмпортДанных");
		ОбъектЗадания.Наименование = Наименование;
//		ОбъектЗадания.КоличествоПовторовПриАварийномЗавершении = 0;
	КонецЕсли;
	ОбъектЗадания.Использование = ВыполнятьПоРасписанию;
	//Передаем параметр (Код)
	Массив = Новый Массив();
	Массив.Добавить(Код);
	ОбъектЗадания.Параметры = Массив;
	ОбъектЗадания.Записать();
	УникальныйИдентификаторРегламентногоЗадания = ОбъектЗадания.УникальныйИдентификатор;
	
КонецПроцедуры

// Возвращает полный путь к файлу импорта для задачи импорта
//
// Параметры:
//  Задача <СправочникСсылка.новаЗадачаИмпортаДанных>
//
// Возвращаемое значение:
//  <Строка>: Полный путь к файлу импорта
//
Функция ПолучитьИмяФайлаДляЗадачи(Задача) Экспорт
	СтрокаТЧИменаФайлов = ИменаФайлов.Найти(Задача, "ЗадачаИмпорта");
	Если СтрокаТЧИменаФайлов = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат КаталогЗагрузки + "\" + СтрокаТЧИменаФайлов.ИмяФайла;
	КонецЕсли;
КонецФункции
